# Terraform environment test
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azurerm_log_analytics_workspace.dp_law_test["dp-be-yt01-insightsWorkspace"]: Reading...
data.azurerm_resource_group.rd_dp_test["dp-be-test-rg"]: Reading...
data.azurerm_resource_group.rd_dp_test["dp-be-yt01-rg"]: Reading...
data.azurerm_log_analytics_workspace.dp_law_test["dp-be-test-insightsWorkspace"]: Reading...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1mMDNmNzU3OS01ZjM5LTRkN2YtYmNlYS04ZTVjYjZkN2FjYTQ7b2JqZWN0SWQ9MDJiMTdkMjgtN2VjOC00MDg0LTkyY2UtZDI2MDUxZmE0OTk4O3N1YnNjcmlwdGlvbklkPTFjZThlOWFmLWMyZDYtNDRlNy05YzVlLTA5OWEzMDgwNTZmZTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
data.azurerm_monitor_data_collection_rule.prometheus: Reading...
data.azurerm_resource_group.rg_studio_prod: Reading...
data.azurerm_resource_group.rd_dp_test["dp-be-test-rg"]: Read complete after 1s [id=/subscriptions/8a353de8-d81d-468d-a40d-f3574b6bb3f4/resourceGroups/dp-be-test-rg]
data.azurerm_resource_group.rg_studio_law_prod: Reading...
data.azurerm_resource_group.rd_dp_test["dp-be-yt01-rg"]: Read complete after 1s [id=/subscriptions/8a353de8-d81d-468d-a40d-f3574b6bb3f4/resourceGroups/dp-be-yt01-rg]
data.azurerm_resource_group.rg_dp_stag: Reading...
data.azurerm_resource_group.rg_studio_dev: Reading...
data.azurerm_log_analytics_workspace.dp_law_test["dp-be-test-insightsWorkspace"]: Read complete after 1s [id=/subscriptions/8a353de8-d81d-468d-a40d-f3574b6bb3f4/resourceGroups/dp-be-test-rg/providers/Microsoft.OperationalInsights/workspaces/dp-be-test-insightsWorkspace]
data.azurerm_resource_group.rg_studio_stag: Reading...
data.azurerm_resource_group.rg_studio_prod: Read complete after 0s [id=/subscriptions/f66298ed-870c-40e0-bb74-6db89c1a364b/resourceGroups/studio-prod-rg]
data.azurerm_resource_group.rg_studio_law_test: Reading...
data.azurerm_resource_group.rg_studio_stag: Read complete after 0s [id=/subscriptions/971ddbb1-27d0-4cc7-a016-461dab5cec05/resourceGroups/studio-staging-rg]
data.azurerm_resource_group.rg_studio_dev: Read complete after 0s [id=/subscriptions/971ddbb1-27d0-4cc7-a016-461dab5cec05/resourceGroups/studio-dev-rg]
data.azurerm_resource_group.rg_studio_law_prod: Read complete after 0s [id=/subscriptions/f66298ed-870c-40e0-bb74-6db89c1a364b/resourceGroups/altinn-rg]
data.azurerm_log_analytics_workspace.dp_law_test["dp-be-yt01-insightsWorkspace"]: Read complete after 2s [id=/subscriptions/8a353de8-d81d-468d-a40d-f3574b6bb3f4/resourceGroups/dp-be-yt01-rg/providers/Microsoft.OperationalInsights/workspaces/dp-be-yt01-insightsWorkspace]
data.azurerm_monitor_data_collection_rule.prometheus: Read complete after 1s [id=/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/MA_k6tests-amw_norwayeast_managed/providers/Microsoft.Insights/dataCollectionRules/k6tests-amw]
data.azurerm_resource_group.rg_dp_stag: Read complete after 1s [id=/subscriptions/e4926efc-0577-47b3-9c3d-757925630eca/resourceGroups/dp-be-staging-rg]
data.azurerm_log_analytics_workspace.studio_law_prod: Reading...
data.azurerm_resource_group.rg_studio_law_test: Read complete after 1s [id=/subscriptions/971ddbb1-27d0-4cc7-a016-461dab5cec05/resourceGroups/altinn-rg]
data.azurerm_log_analytics_workspace.dp_law_stag: Reading...
data.azurerm_log_analytics_workspace.studio_law_test: Reading...
data.azurerm_resource_group.rg_dp_prod: Reading...
data.azurerm_resource_group.rg_dp_prod: Read complete after 1s [id=/subscriptions/c595f787-450d-4c57-84fa-abc5f95d5459/resourceGroups/dp-be-prod-rg]
data.azurerm_log_analytics_workspace.studio_law_prod: Read complete after 1s [id=/subscriptions/f66298ed-870c-40e0-bb74-6db89c1a364b/resourceGroups/altinn-rg/providers/Microsoft.OperationalInsights/workspaces/altinn-studio-prod-log]
data.azurerm_log_analytics_workspace.studio_law_test: Read complete after 1s [id=/subscriptions/971ddbb1-27d0-4cc7-a016-461dab5cec05/resourceGroups/altinn-rg/providers/Microsoft.OperationalInsights/workspaces/altinn-studio-test-log]
data.azurerm_log_analytics_workspace.dp_law_stag: Read complete after 1s [id=/subscriptions/e4926efc-0577-47b3-9c3d-757925630eca/resourceGroups/dp-be-staging-rg/providers/Microsoft.OperationalInsights/workspaces/dp-be-staging-insightsWorkspace]
data.azurerm_log_analytics_workspace.dp_law_prod: Reading...
data.azurerm_log_analytics_workspace.dp_law_prod: Read complete after 1s [id=/subscriptions/c595f787-450d-4c57-84fa-abc5f95d5459/resourceGroups/dp-be-prod-rg/providers/Microsoft.OperationalInsights/workspaces/dp-be-prod-insightsWorkspace]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # helm_release.k6_operator will be updated in-place
  ~ resource "helm_release" "k6_operator" {
      ~ id                         = "k6-operator" -> (known after apply)
      ~ metadata                   = {
          ~ app_version    = "0.0.19" -> (known after apply)
          ~ chart          = "k6-operator" -> (known after apply)
          ~ first_deployed = 1733489406 -> (known after apply)
          ~ last_deployed  = 1742452248 -> (known after apply)
          ~ name           = "k6-operator" -> (known after apply)
          ~ namespace      = "k6-operator-system" -> (known after apply)
          ~ notes          = <<-EOT
                Thank you for installing k6-operator.
                
                Your release is named k6-operator.
                
                To learn more about the release, try:
                
                  $ helm status k6-operator
                  $ helm get all k6-operator
            EOT -> (known after apply)
          ~ revision       = 3 -> (known after apply)
          ~ values         = jsonencode({}) -> (known after apply)
          ~ version        = "3.11.1" -> (known after apply)
        } -> (known after apply)
        name                       = "k6-operator"
      - postrender                 = {
          - args        = [] -> null
          - binary_path = "" -> null
        } -> null
      - set                        = [] -> null
      - set_list                   = [] -> null
      - set_sensitive              = [] -> null
      - set_wo_revision            = 1 -> null
        # (28 unchanged attributes hidden)
    }

  # helm_release.kube_prometheus_stack will be updated in-place
  ~ resource "helm_release" "kube_prometheus_stack" {
      ~ id                         = "kube-prometheus-stack" -> (known after apply)
      ~ metadata                   = {
          ~ app_version    = "v0.81.0" -> (known after apply)
          ~ chart          = "kube-prometheus-stack" -> (known after apply)
          ~ first_deployed = 1733406099 -> (known after apply)
          ~ last_deployed  = 1742452249 -> (known after apply)
          ~ name           = "kube-prometheus-stack" -> (known after apply)
          ~ namespace      = "monitoring" -> (known after apply)
          ~ notes          = <<-EOT
                kube-prometheus-stack has been installed. Check its status by running:
                  kubectl --namespace monitoring get pods -l "release=kube-prometheus-stack"
                
                Get Grafana 'admin' user password by running:
                
                  kubectl --namespace monitoring get secrets kube-prometheus-stack-grafana -o jsonpath="{.data.admin-password}" | base64 -d ; echo
                
                Access Grafana local instance:
                
                  export POD_NAME=$(kubectl --namespace monitoring get pod -l "app.kubernetes.io/name=grafana,app.kubernetes.io/instance=kube-prometheus-stack" -oname)
                  kubectl --namespace monitoring port-forward $POD_NAME 3000
                
                Visit https://github.com/prometheus-operator/kube-prometheus for instructions on how to create & configure Alertmanager and Prometheus instances using the Operator.
                
                1. Get the application URL by running these commands:
                  export POD_NAME=$(kubectl get pods --namespace monitoring -l "app.kubernetes.io/name=prometheus-node-exporter,app.kubernetes.io/instance=kube-prometheus-stack" -o jsonpath="{.items[0].metadata.name}")
                  echo "Visit http://127.0.0.1:9100 to use your application"
                  kubectl port-forward --namespace monitoring $POD_NAME 9100
                kube-state-metrics is a simple service that listens to the Kubernetes API server and generates metrics about the state of the objects.
                The exposed metrics can be found here:
                https://github.com/kubernetes/kube-state-metrics/blob/master/docs/README.md#exposed-metrics
                
                The metrics are exported on the HTTP endpoint /metrics on the listening port.
                In your case, kube-prometheus-stack-kube-state-metrics.monitoring.svc.cluster.local:8080/metrics
                
                They are served either as plaintext or protobuf depending on the Accept header.
                They are designed to be consumed either by Prometheus itself or by a scraper that is compatible with scraping a Prometheus client endpoint.
            EOT -> (known after apply)
          ~ revision       = 20 -> (known after apply)
          ~ values         = jsonencode({}) -> (known after apply)
          ~ version        = "70.0.2" -> (known after apply)
        } -> (known after apply)
        name                       = "kube-prometheus-stack"
      - postrender                 = {
          - args        = [] -> null
          - binary_path = "" -> null
        } -> null
      - set                        = [] -> null
      - set_list                   = [] -> null
      - set_sensitive              = [] -> null
      - set_wo_revision            = 1 -> null
        # (28 unchanged attributes hidden)
    }

  # helm_release.prometheus_operator_crds will be updated in-place
  ~ resource "helm_release" "prometheus_operator_crds" {
      ~ id                         = "prometheus-operator-crds" -> (known after apply)
      ~ metadata                   = {
          ~ app_version    = "v0.80.1" -> (known after apply)
          ~ chart          = "prometheus-operator-crds" -> (known after apply)
          ~ first_deployed = 1733406085 -> (known after apply)
          ~ last_deployed  = 1741248275 -> (known after apply)
          ~ name           = "prometheus-operator-crds" -> (known after apply)
          ~ namespace      = "default" -> (known after apply)
          + notes          = (known after apply)
          ~ revision       = 5 -> (known after apply)
          ~ values         = jsonencode({}) -> (known after apply)
          ~ version        = "18.0.1" -> (known after apply)
        } -> (known after apply)
        name                       = "prometheus-operator-crds"
      - postrender                 = {
          - args        = [] -> null
          - binary_path = "" -> null
        } -> null
      - set                        = [] -> null
      - set_list                   = [] -> null
      - set_sensitive              = [] -> null
      - set_wo_revision            = 1 -> null
        # (27 unchanged attributes hidden)
    }

  # helm_release.pyrra will be updated in-place
  ~ resource "helm_release" "pyrra" {
      ~ id                         = "pyrra" -> (known after apply)
      ~ metadata                   = {
          ~ app_version    = "v0.8.1" -> (known after apply)
          ~ chart          = "pyrra" -> (known after apply)
          ~ first_deployed = 1733740610 -> (known after apply)
          ~ last_deployed  = 1733740610 -> (known after apply)
          ~ name           = "pyrra" -> (known after apply)
          ~ namespace      = "pyrra-system" -> (known after apply)
          ~ notes          = <<-EOT
                1. Get the application URL by running these commands:
                  export POD_NAME=$(kubectl get pods --namespace pyrra-system -l "app.kubernetes.io/name=pyrra,app.kubernetes.io/instance=pyrra" -o jsonpath="{.items[0].metadata.name}")
                  export CONTAINER_PORT=$(kubectl get pod --namespace pyrra-system $POD_NAME -o jsonpath="{.spec.containers[0].ports[0].containerPort}")
                  echo "Visit http://127.0.0.1:8080 to use your application"
                  kubectl --namespace pyrra-system port-forward $POD_NAME 8080:$CONTAINER_PORT
            EOT -> (known after apply)
          ~ revision       = 1 -> (known after apply)
          ~ values         = jsonencode({}) -> (known after apply)
          ~ version        = "0.14.2" -> (known after apply)
        } -> (known after apply)
        name                       = "pyrra"
      - postrender                 = {
          - args        = [] -> null
          - binary_path = "" -> null
        } -> null
      - set_list                   = [] -> null
      - set_sensitive              = [] -> null
      - set_wo_revision            = 1 -> null
        # (28 unchanged attributes hidden)
    }

  # helm_release.sealed_secrets will be updated in-place
  ~ resource "helm_release" "sealed_secrets" {
      ~ id                         = "sealedsecrets" -> (known after apply)
      ~ metadata                   = {
          ~ app_version    = "0.28.0" -> (known after apply)
          ~ chart          = "sealed-secrets" -> (known after apply)
          ~ first_deployed = 1733733169 -> (known after apply)
          ~ last_deployed  = 1739360268 -> (known after apply)
          ~ name           = "sealedsecrets" -> (known after apply)
          ~ namespace      = "sealedsecrets-system" -> (known after apply)
          ~ notes          = <<-EOT
                ** Please be patient while the chart is being deployed **
                
                You should now be able to create sealed secrets.
                
                1. Install the client-side tool (kubeseal) as explained in the docs below:
                
                    https://github.com/bitnami-labs/sealed-secrets#installation-from-source
                
                2. Create a sealed secret file running the command below:
                
                    kubectl create secret generic secret-name --dry-run=client --from-literal=foo=bar -o [json|yaml] |                     kubeseal                       --controller-name=sealedsecrets-sealed-secrets                       --controller-namespace=sealedsecrets-system                       --format yaml > mysealedsecret.[json|yaml]
                
                The file mysealedsecret.[json|yaml] is a commitable file.
                
                If you would rather not need access to the cluster to generate the sealed secret you can run:
                
                    kubeseal                       --controller-name=sealedsecrets-sealed-secrets                       --controller-namespace=sealedsecrets-system                       --fetch-cert > mycert.pem
                
                to retrieve the public cert used for encryption and store it locally. You can then run 'kubeseal --cert mycert.pem' instead to use the local cert e.g.
                
                    kubectl create secret generic secret-name --dry-run=client --from-literal=foo=bar -o [json|yaml] |                     kubeseal                       --controller-name=sealedsecrets-sealed-secrets                       --controller-namespace=sealedsecrets-system                       --format [json|yaml] --cert mycert.pem > mysealedsecret.[json|yaml]
                
                3. Apply the sealed secret
                
                    kubectl create -f mysealedsecret.[json|yaml]
                
                Running 'kubectl get secret secret-name -o [json|yaml]' will show the decrypted secret that was generated from the sealed secret.
                
                Both the SealedSecret and generated Secret must have the same name and namespace.
            EOT -> (known after apply)
          ~ revision       = 2 -> (known after apply)
          ~ values         = jsonencode({}) -> (known after apply)
          ~ version        = "2.17.1" -> (known after apply)
        } -> (known after apply)
        name                       = "sealedsecrets"
      - postrender                 = {
          - args        = [] -> null
          - binary_path = "" -> null
        } -> null
      - set                        = [] -> null
      - set_list                   = [] -> null
      - set_sensitive              = [] -> null
      - set_wo_revision            = 1 -> null
        # (27 unchanged attributes hidden)
    }

  # kubernetes_cluster_role_v1.dev_access will be updated in-place
  ~ resource "kubernetes_cluster_role_v1" "dev_access" {
        id = "dev-access"

      ~ rule {
          ~ verbs             = [
                # (3 unchanged elements hidden)
                "delete",
              + "patch",
            ]
            # (4 unchanged attributes hidden)
        }
      ~ rule {
          ~ api_groups        = [
              ~ null -> "bitnami.com",
            ]
          ~ resources         = [
              ~ "secrets" -> "sealedsecrets",
            ]
          ~ verbs             = [
                # (1 unchanged element hidden)
                "watch",
              + "delete",
            ]
            # (2 unchanged attributes hidden)
        }
      - rule {
          - api_groups        = [
              - "bitnami.com",
            ] -> null
          - non_resource_urls = [] -> null
          - resource_names    = [] -> null
          - resources         = [
              - "sealedsecrets",
            ] -> null
          - verbs             = [
              - "list",
              - "watch",
              - "delete",
            ] -> null
        }

        # (3 unchanged blocks hidden)
    }

  # kubernetes_cluster_role_v1.sp_access will be updated in-place
  ~ resource "kubernetes_cluster_role_v1" "sp_access" {
        id = "github-sp-access"

      ~ rule {
          ~ verbs             = [
                # (3 unchanged elements hidden)
                "get",
              + "patch",
            ]
            # (4 unchanged attributes hidden)
        }
      ~ rule {
          ~ verbs             = [
                # (5 unchanged elements hidden)
                "delete",
              + "patch",
            ]
            # (4 unchanged attributes hidden)
        }

        # (4 unchanged blocks hidden)
    }

Plan: 0 to add, 7 to change, 0 to destroy.

Warning: UpgradeState Triggered

  with helm_release.k6_operator,
  on k6_tests_rg_k6_operator.tf line 1, in resource "helm_release" "k6_operator":
   1: resource "helm_release" "k6_operator" {

Successfully migrated state from SDKv2 to Plugin Framework

(and 4 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @monteiro-renato |
| Action | `pull_request` |
| Working Directory | `./infrastructure/adminservices-test/altinn-monitor-test-rg` |
| State File | `github.com/altinn/altinn-platform/environments/test/altinn-monitor-test-rg.tfstate` |
| Plan File | `github.com_altinn_altinn-platform_environments_test_altinn-monitor-test-rg.tfstate.tfplan`